import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")

ADMIN_ID = os.getenv("ADMIN_ID")

# Словник питань під конкретні курси (Key = postId)

COURSE_CONFIG = {
    # Системний маркетинг
    38796: {
        "q1": "Який ваш загальний рівень у маркетингу?",
        "q2": "Як ви оцінюєте свої навички роботи з фінансами (P&L, ROI, бюджетування)?",
        "q3": "Який у вас досвід управління командою або стратегією?"
    },
    # Data Science
    29479: {
        "q1": "Наскільки добре ви знаєте Python (або іншу мову програмування)?",
        "q2": "Який ваш рівень у вищій математиці та статистиці?",
        "q3": "Чи був у вас досвід навчання або створення ML-моделей?"
    },
    # Power BI
    29955: {
        "q1": "Який ваш рівень володіння Excel (зведені таблиці, складні формули)?",
        "q2": "Чи є у вас досвід роботи з базами даних (SQL, Access)?",
        "q3": "Чи пробували ви вже будувати дашборди (візуалізацію даних)?"
    },
    # Computer Vision
    39174: {
        "q1": "Який ваш рівень програмування (Python/C++)?",
        "q2": "Наскільки глибоко ви розумієте роботу нейромереж (Deep Learning)?",
        "q3": "Чи є у вас досвід роботи з бібліотеками OpenCV, PyTorch або TensorFlow?"
    }
}

# Дефолтні питання (на випадок нових курсів)
DEFAULT_QUESTIONS = {
    "q1": "Як ви оцінюєте свої теоретичні знання в цій сфері?",
    "q2": "Який ваш рівень володіння необхідними інструментами?",
    "q3": "Чи є у вас практичний досвід вирішення завдань за цим напрямом?"
}